LJY7723/esp32yk/1.ControllerSystem/build/sketch/libraries/RF24/RF24.cpp
#if defined(RF24_LINUX) || defined(RF24_RP2)
    beginTransaction();
    uint8_t* prx = spi_rxbuff;
    uint8_t* ptx = spi_txbuff;
    uint8_t size;
    size = static_cast<uint8_t>(data_len + blank_len + 1); // Add register value to transmit buffer

    *ptx++ = R_RX_PAYLOAD;
    while (--size) {
        *ptx++ = RF24_NOP;
    }

    size = static_cast<uint8_t>(data_len + blank_len + 1); // Size has been lost during while, re affect

    #if defined(RF24_RP2)
    _spi->transfernb((const uint8_t*)spi_txbuff, spi_rxbuff, size);
    #else  // !defined(RF24_RP2)
    _SPI.transfernb(reinterpret_cast<char*>(spi_txbuff), reinterpret_cast<char*>(spi_rxbuff), size);
    #endif // !defined(RF24_RP2)

    status = *prx++; // 1st byte is status

    if (data_len > 0) {
        // Decrement before to skip 1st status byte
        while (--data_len) {
            *current++ = *prx++;
        }

        *current = *prx;
    }
    endTransaction();
#else // !defined(RF24_LINUX) && !defined(RF24_RP2)

    beginTransaction();
    #if defined(RF24_SPI_PTR)
    status = _spi->transfer(R_RX_PAYLOAD);
    while (data_len--) {
        *current++ = _spi->transfer(0xFF);
    }

    while (blank_len--) {
        _spi->transfer(0xFF);
    }

    #else // !defined(RF24_SPI_PTR)
    status = _SPI.transfer(R_RX_PAYLOAD);
    while (data_len--) {
        *current++ = _SPI.transfer(0xFF);
    }

    while (blank_len--) {
        _SPI.transfer(0xff);
    }

    #endif // !defined(RF24_SPI_PTR)
    endTransaction();

#endif // !defined(RF24_LINUX) && !defined(RF24_RP2)
}

/****************************************************************************/

uint8_t RF24::flush_rx(void)
{
    read_register(FLUSH_RX, (uint8_t*)nullptr, 0);
    IF_RF24_DEBUG(printf_P("[Flushing RX FIFO]"););
    return status;
}

/****************************************************************************/

uint8_t RF24::flush_tx(void)
{
    read_register(FLUSH_TX, (uint8_t*)nullptr, 0);
    IF_RF24_DEBUG(printf_P("[Flushing RX FIFO]"););
    return status;
}

/****************************************************************************/
#if !defined(MINIMAL)

void RF24::printStatus(uint8_t flags)
{
    printf_P(PSTR("RX_DR=%x TX_DS=%x TX_DF=%x RX_PIPE=%x TX_FULL=%x\r\n"),
             (flags & RF24_RX_DR) ? 1 : 0,
             (flags & RF24_TX_DS) ? 1 : 0,
             (flags & RF24_TX_DF) ? 1 : 0,
             (flags >> RX_P_NO) & 0x07,
             (flags & _BV(TX_FULL)) ? 1 : 0);
}

/****************************************************************************/

void RF24::print_observe_tx(uint8_t value)
{
    printf_P(PSTR("OBSERVE_TX=%02x: PLOS_CNT=%x ARC_CNT=%x\r\n"), value, (value >> PLOS_CNT) & 0x0F, (value >> ARC_CNT) & 0x0F);
}

/****************************************************************************/

void RF24::print_byte_register(const char* name, uint8_t reg, uint8_t qty)
{
    printf_P(PSTR(PRIPSTR
                  "\t="),
             name);
    while (qty--) {
        printf_P(PSTR(" 0x%02x"), read_register(reg++));
    }
    printf_P(PSTR("\r\n"));
}

/****************************************************************************/

void RF24::print_address_register(const char* name, uint8_t reg, uint8_t qty)
{

    printf_P(PSTR(PRIPSTR
                  "\t="),
             name);
    while (qty--) {
        uint8_t* buffer = new uint8_t[addr_width];
        read_register(reg++, buffer, addr_width);

        printf_P(PSTR(" 0x"));
        uint8_t* bufptr = buffer + addr_width;
        while (--bufptr >= buffer) {
            printf_P(PSTR("%02x"), *bufptr); // NOLINT: clang-tidy seems to emit a false positive about zero-allocated memory here (*bufptr)
        }
        delete[] buffer;
    }
    printf_P(PSTR("\r\n"));
}

/****************************************************************************/

uint8_t RF24::sprintf_address_register(char* out_buffer, uint8_t reg, uint8_t qty)
{
    uint8_t offset = 0;
    uint8_t* read_buffer = new uint8_t[addr_width];
    while (qty--) {
        read_register(reg++, read_buffer, addr_width);
        uint8_t* bufptr = read_buffer + addr_width;
        while (--bufptr >= read_buffer) {
            offset += sprintf_P(out_buffer + offset, PSTR("%02X"), *bufptr); // NOLINT(clang-analyzer-cplusplus.NewDelete)
        }
    }
    delete[] read_buffer;
    return offset;
}
#endif // !defined(MINIMAL)

/****************************************************************************/

RF24::RF24(rf24_gpio_pin_t _cepin, rf24_gpio_pin_t _cspin, uint32_t _spi_speed)
    : ce_pin(_cepin),
      csn_pin(_cspin),
      spi_speed(_spi_speed),
      payload_size(32),
      _is_p_variant(false),
      _is_p0_rx(false),
      addr_width(5),
      dynamic_payloads_enabled(true),
#if defined FAILURE_HANDLING
      failureDetected(0),
#endif
      csDelay(5)
{
    _init_obj();
}

/****************************************************************************/

RF24::RF24(uint32_t _spi_speed)
    : ce_pin(RF24_PIN_INVALID),
      csn_pin(RF24_PIN_INVALID),
      spi_speed(_spi_speed),
      payload_size(32),
      _is_p_variant(false),
      _is_p0_rx(false),
      addr_width(5),
      dynamic_payloads_enabled(true),
#if defined FAILURE_HANDLING
      failureDetected(0),
#endif
      csDelay(5)
{
    _init_obj();
}

/****************************************************************************/

void RF24::_init_obj()
{
    // Use a pointer on the Arduino platform

#if defined(RF24_SPI_PTR) && !defined(RF24_RP2)
    _spi = &SPI;
#endif // defined (RF24_SPI_PTR)

    if (spi_speed <= 35000) { //Handle old BCM2835 speed constants, default to RF24_SPI_SPEED
        spi_speed = RF24_SPI_SPEED;
    }
}

/****************************************************************************/

void RF24::setChannel(uint8_t channel)
{
    const uint8_t max_channel = 125;
    write_register(RF_CH, rf24_min(channel, max_channel));
}

uint8_t RF24::getChannel()
{
    return read_register(RF_CH);
}

/****************************************************************************/

void RF24::setPayloadSize(uint8_t size)
{
    // payload size must be in range [1, 32]
    payload_size = static_cast<uint8_t>(rf24_max(1, rf24_min(32, size)));

