LJY7723/esp32yk/1.ControllerSystem/build/sketch/libraries/RF24/RF24.cpp
/****************************************************************************/

static const PROGMEM uint8_t child_pipe_enable[] = {ERX_P0, ERX_P1, ERX_P2,
                                                    ERX_P3, ERX_P4, ERX_P5};

void RF24::stopListening(void)
{
    ce(LOW);

    //delayMicroseconds(100);
    delayMicroseconds(static_cast<int>(txDelay));
    if (ack_payloads_enabled) {
        flush_tx();
    }

    config_reg = static_cast<uint8_t>(config_reg & ~_BV(PRIM_RX));
    write_register(NRF_CONFIG, config_reg);

#if defined(RF24_TINY) || defined(LITTLEWIRE)
    // for 3 pins solution TX mode is only left with additional powerDown/powerUp cycle
    if (ce_pin == csn_pin) {
        powerDown();
        powerUp();
    }
#endif
    write_register(RX_ADDR_P0, pipe0_writing_address, addr_width);
    write_register(EN_RXADDR, static_cast<uint8_t>(read_register(EN_RXADDR) | _BV(pgm_read_byte(&child_pipe_enable[0])))); // Enable RX on pipe0
}

/****************************************************************************/

void RF24::stopListening(const uint64_t txAddress)
{
    memcpy(pipe0_writing_address, &txAddress, addr_width);
    stopListening();
    write_register(TX_ADDR, pipe0_writing_address, addr_width);
}

/****************************************************************************/

void RF24::stopListening(const uint8_t* txAddress)
{
    memcpy(pipe0_writing_address, txAddress, addr_width);
    stopListening();
    write_register(TX_ADDR, pipe0_writing_address, addr_width);
}

/****************************************************************************/

void RF24::powerDown(void)
{
    ce(LOW); // Guarantee CE is low on powerDown
    config_reg = static_cast<uint8_t>(config_reg & ~_BV(PWR_UP));
    write_register(NRF_CONFIG, config_reg);
}

/****************************************************************************/

//Power up now. Radio will not power down unless instructed by MCU for config changes etc.
void RF24::powerUp(void)
{
    // if not powered up then power up and wait for the radio to initialize
    if (!(config_reg & _BV(PWR_UP))) {
        config_reg |= _BV(PWR_UP);
        write_register(NRF_CONFIG, config_reg);

        // For nRF24L01+ to go from power down mode to TX or RX mode it must first pass through stand-by mode.
        // There must be a delay of Tpd2stby (see Table 16.) after the nRF24L01+ leaves power down mode before
        // the CEis set high. - Tpd2stby can be up to 5ms per the 1.0 datasheet
        delayMicroseconds(RF24_POWERUP_DELAY);
    }
}

/******************************************************************/
#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)

void RF24::errNotify()
{
    #if defined(RF24_DEBUG) || defined(RF24_LINUX)
    printf_P(PSTR("RF24 HARDWARE FAIL: Radio not responding, verify pin connections, wiring, etc.\r\n"));
    #endif
    #if defined(FAILURE_HANDLING)
    failureDetected = 1;
    #else
    delay(5000);
    #endif
}

#endif
/******************************************************************/

//Similar to the previous write, clears the interrupt flags
bool RF24::write(const void* buf, uint8_t len, const bool multicast)
{
    //Start Writing
    startFastWrite(buf, len, multicast);

//Wait until complete or failed
#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
    uint32_t timer = millis();
#endif // defined(FAILURE_HANDLING) || defined(RF24_LINUX)

    while (!(update() & (RF24_TX_DS | RF24_TX_DF))) {
#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
        if (millis() - timer > 95) {
            errNotify();
    #if defined(FAILURE_HANDLING)
            return 0;
    #else
            delay(100);
    #endif
        }
#endif
    }

    ce(LOW);

    write_register(NRF_STATUS, RF24_IRQ_ALL);

    //Max retries exceeded
    if (status & RF24_TX_DF) {
        flush_tx(); // Only going to be 1 packet in the FIFO at a time using this method, so just flush
        return 0;
    }
    //TX OK 1 or 0
    return 1;
}

bool RF24::write(const void* buf, uint8_t len)
{
    return write(buf, len, 0);
}

/****************************************************************************/

//For general use, the interrupt flags are not important to clear
bool RF24::writeBlocking(const void* buf, uint8_t len, uint32_t timeout)
{
    //Block until the FIFO is NOT full.
    //Keep track of the MAX retries and set auto-retry if seeing failures
    //This way the FIFO will fill up and allow blocking until packets go through
    //The radio will auto-clear everything in the FIFO as long as CE remains high

    uint32_t timer = millis(); // Get the time that the payload transmission started

    while (update() & _BV(TX_FULL)) { // Blocking only if FIFO is full. This will loop and block until TX is successful or timeout

        if (status & RF24_TX_DF) { // If MAX Retries have been reached
            reUseTX();             // Set re-transmit and clear the MAX_RT interrupt flag
            if (millis() - timer > timeout) {
                return 0; // If this payload has exceeded the user-defined timeout, exit and return 0
            }
        }
#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
        if (millis() - timer > (timeout + 95)) {
            errNotify();
    #if defined(FAILURE_HANDLING)
            return 0;
    #endif
        }
#endif
    }

    //Start Writing
    startFastWrite(buf, len, 0); // Write the payload if a buffer is clear

    return 1; // Return 1 to indicate successful transmission
}

/****************************************************************************/

void RF24::reUseTX()
{
    ce(LOW);
    write_register(NRF_STATUS, RF24_TX_DF); //Clear max retry flag
    read_register(REUSE_TX_PL, (uint8_t*)nullptr, 0);
    IF_RF24_DEBUG(printf_P("[Reusing payload in TX FIFO]"););
    ce(HIGH); //Re-Transfer packet
}

/****************************************************************************/

bool RF24::writeFast(const void* buf, uint8_t len, const bool multicast)
{
    //Block until the FIFO is NOT full.
    //Keep track of the MAX retries and set auto-retry if seeing failures
    //Return 0 so the user can control the retries and set a timer or failure counter if required
    //The radio will auto-clear everything in the FIFO as long as CE remains high

#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
    uint32_t timer = millis();
#endif

    //Blocking only if FIFO is full. This will loop and block until TX is successful or fail
    while (update() & _BV(TX_FULL)) {
        if (status & RF24_TX_DF) {
            return 0; //Return 0. The previous payload has not been retransmitted
            // From the user perspective, if you get a 0, call txStandBy()
        }
#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
        if (millis() - timer > 95) {
            errNotify();
    #if defined(FAILURE_HANDLING)
            return 0;
    #endif // defined(FAILURE_HANDLING)
        }
#endif
    }
    startFastWrite(buf, len, multicast); // Start Writing

    return 1;
}

