LJY7723/esp32yk/1.ControllerSystem/build/sketch/libraries/RF24/RF24.cpp
bool RF24::writeFast(const void* buf, uint8_t len)
{
    return writeFast(buf, len, 0);
}

/****************************************************************************/

//Per the documentation, we want to set PTX Mode when not listening. Then all we do is write data and set CE high
//In this mode, if we can keep the FIFO buffers loaded, packets will transmit immediately (no 130us delay)
//Otherwise we enter Standby-II mode, which is still faster than standby mode
//Also, we remove the need to keep writing the config register over and over and delaying for 150 us each time if sending a stream of data

void RF24::startFastWrite(const void* buf, uint8_t len, const bool multicast, bool startTx)
{ //TMRh20

    write_payload(buf, len, multicast ? W_TX_PAYLOAD_NO_ACK : W_TX_PAYLOAD);
    if (startTx) {
        ce(HIGH);
    }
}

/****************************************************************************/

//Added the original startWrite back in so users can still use interrupts, ack payloads, etc
//Allows the library to pass all tests
bool RF24::startWrite(const void* buf, uint8_t len, const bool multicast)
{

    // Send the payload
    write_payload(buf, len, multicast ? W_TX_PAYLOAD_NO_ACK : W_TX_PAYLOAD);
    ce(HIGH);
#if !defined(F_CPU) || F_CPU > 20000000
    delayMicroseconds(10);
#endif
#ifdef ARDUINO_ARCH_STM32
    if (F_CPU > 20000000) {
        delayMicroseconds(10);
    }
#endif
    ce(LOW);
    return !(status & _BV(TX_FULL));
}

/****************************************************************************/

bool RF24::rxFifoFull()
{
    return read_register(FIFO_STATUS) & _BV(RX_FULL);
}

/****************************************************************************/

rf24_fifo_state_e RF24::isFifo(bool about_tx)
{
    uint8_t state = (read_register(FIFO_STATUS) >> (4 * about_tx)) & 3;
    return static_cast<rf24_fifo_state_e>(state);
}

/****************************************************************************/

bool RF24::isFifo(bool about_tx, bool check_empty)
{
    return static_cast<bool>(static_cast<uint8_t>(isFifo(about_tx)) & _BV(!check_empty));
}

/****************************************************************************/

bool RF24::txStandBy()
{

#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
    uint32_t timeout = millis();
#endif
    while (!(read_register(FIFO_STATUS) & _BV(TX_EMPTY))) {
        if (status & RF24_TX_DF) {
            write_register(NRF_STATUS, RF24_TX_DF);
            ce(LOW);
            flush_tx(); //Non blocking, flush the data
            return 0;
        }
#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
        if (millis() - timeout > 95) {
            errNotify();
    #if defined(FAILURE_HANDLING)
            return 0;
    #endif
        }
#endif
    }

    ce(LOW); //Set STANDBY-I mode
    return 1;
}

/****************************************************************************/

bool RF24::txStandBy(uint32_t timeout, bool startTx)
{

    if (startTx) {
        stopListening();
        ce(HIGH);
    }
    uint32_t start = millis();

    while (!(read_register(FIFO_STATUS) & _BV(TX_EMPTY))) {
        if (status & RF24_TX_DF) {
            write_register(NRF_STATUS, RF24_TX_DF);
            ce(LOW); // Set re-transmit
            ce(HIGH);
            if (millis() - start >= timeout) {
                ce(LOW);
                flush_tx();
                return 0;
            }
        }
#if defined(FAILURE_HANDLING) || defined(RF24_LINUX)
        if (millis() - start > (timeout + 95)) {
            errNotify();
    #if defined(FAILURE_HANDLING)
            return 0;
    #endif
        }
#endif
    }

    ce(LOW); //Set STANDBY-I mode
    return 1;
}

/****************************************************************************/

void RF24::maskIRQ(bool tx, bool fail, bool rx)
{
    /* clear the interrupt flags */
    config_reg = static_cast<uint8_t>(config_reg & ~(1 << MASK_MAX_RT | 1 << MASK_TX_DS | 1 << MASK_RX_DR));
    /* set the specified interrupt flags */
    config_reg = static_cast<uint8_t>(config_reg | fail << MASK_MAX_RT | tx << MASK_TX_DS | rx << MASK_RX_DR);
    write_register(NRF_CONFIG, config_reg);
}

/****************************************************************************/

uint8_t RF24::getDynamicPayloadSize(void)
{
    uint8_t result = read_register(R_RX_PL_WID);

    if (result > 32 || !result) {
        flush_rx();
        return 0;
    }
    return result;
}

/****************************************************************************/

bool RF24::available(void)
{
    return (read_register(FIFO_STATUS) & 1) == 0;
}

/****************************************************************************/

bool RF24::available(uint8_t* pipe_num)
{
    if (available()) { // if RX FIFO is not empty
        *pipe_num = (update() >> RX_P_NO) & 0x07;
        return 1;
    }
    return 0;
}

/****************************************************************************/

void RF24::read(void* buf, uint8_t len)
{

    // Fetch the payload
    read_payload(buf, len);

    //Clear the only applicable interrupt flags
    write_register(NRF_STATUS, RF24_RX_DR);
}

/****************************************************************************/

void RF24::whatHappened(bool& tx_ok, bool& tx_fail, bool& rx_ready)
{
    // Read the status & reset the status in one easy call
    // Or is that such a good idea?
    write_register(NRF_STATUS, RF24_IRQ_ALL);

    // Report to the user what happened
    tx_ok = status & RF24_TX_DS;
    tx_fail = status & RF24_TX_DF;
    rx_ready = status & RF24_RX_DR;
}

/****************************************************************************/

uint8_t RF24::clearStatusFlags(uint8_t flags)
{
    write_register(NRF_STATUS, flags & RF24_IRQ_ALL);
    return status;
}

/****************************************************************************/

void RF24::setStatusFlags(uint8_t flags)
{
    // flip the `flags` to translate from "human understanding"
    config_reg = (config_reg & ~RF24_IRQ_ALL) | (~flags & RF24_IRQ_ALL);
    write_register(NRF_CONFIG, config_reg);
}

